In [ ]:
Q1. What is data encoding? How is it useful in data science?

In [ ]:
A1. Data encoding is the process of converting data from one format or representation into other, with the 
    goal of preparing it for specific task. 
    It is useful in data science as it allows transforming raw data into a format that can be easily undertood
    by the machine learning model like categorical data into numerical representation.

In [ ]:
Q2. What is nominal encoding? Provide an example of how you would use it in a real-world scenario.

In [ ]:
A2. Nominal encoding also known as one hot encoding is a technique used to convert categorical variables 
    into numerical representations. Each category is assigned a special integer value but there is no hierarchy
    of values among the categories.
    EG: If we are working on a model which has to predict or recommend movies like Netflix or Amazon Prime,
        we assign a number to each genre like action, comedy, fantasy etc. Here no genre is greater or lesser 
        than other but they are assigned integer values just for the model's understanding.

In [ ]:
Q3. In what situations is nominal encoding preferred over one-hot encoding? Provide a practical example.

In [ ]:
A3. Nominal encoding is preferred over one hot encoding where the categorical variable has large number of
    unique categories or labels. One hot encoding leads to large number of high-dimensional and sparse 
    representation of data, which can be computationally expensive and memory intensive. In such cases we can
    use nominal encoding.
    Eg: Imagine we are working on product classification task for amazon or snapdeal. There are many thousands
    of products and each product belongs to a category like electronic, clothing, furniture, stationary etc.
    When we have thousands of products, one hot encoder creates unneccessary large number of columns which 
    just take up memory of program and reduce the computational speed.
    Instead we can use Nominal encoding and encode each category a specific integer. The product category will
    be shown by the integer and it will occupy only 1 column.

In [ ]:
Q4. Suppose you have a dataset containing categorical data with 5 unique values. Which encoding
technique would you use to transform this data into a format suitable for machine learning algorithms?
Explain why you made this choice.

In [ ]:
A4. I would use nominal encoding technique to transform the data into a format suitable for machine learning
    model. Since the data are 5 unique values, one hot encoder would create 5 extra columns which might reduce
    the computational speed compared to nominal encoding where only 1 extra column is created.

In [ ]:
Q5. In a machine learning project, you have a dataset with 1000 rows and 5 columns. Two of the columns
are categorical, and the remaining three columns are numerical. If you were to use nominal encoding to
transform the categorical data, how many new columns would be created? Show your calculations.

In [ ]:
A5. Given that in the dataset there are 2 categorical columns so if we assume both the columns have different
    categorical datas then nominal encoding would create 2 new columns for the encoding as it assigns a value
    to each of the category and creates a new column to store the value.
    columns = 3 (numerical) + 2 (categorical) , Therefore 2 new columns for encoding

In [ ]:
Q6. You are working with a dataset containing information about different types of animals, including their
species, habitat, and diet. Which encoding technique would you use to transform the categorical data into
a format suitable for machine learning algorithms? Justify your answer.

In [ ]:
A6. I would use nominal encoding system to contain information about different types of animals, and would 
    give values to species, habitat, diet by using nominal encoding. It creates only 3 new columns and the 
    categories are given integer values like for species carnivore, herbivore, omnivore we can give 1,2,3 values
    and habitat like mountain, grassland, ocean again 1,2,3 etc. Like this in only 3 new columns every animal and
    its classification is done.

In [ ]:
Q7.You are working on a project that involves predicting customer churn for a telecommunications
company. You have a dataset with 5 features, including the customer's gender, age, contract type,
monthly charges, and tenure. Which encoding technique(s) would you use to transform the categorical
data into numerical data? Provide a step-by-step explanation of how you would implement the encoding.

In [ ]:
A7. Only 2 features, gender and contract type are categorical and all others are numerical type. So I would
    use nominal encoding to transform the categorical data into numerical data. Gender has only 2 types
    male and female so I can use binary encoding for it.
    Contract type can be different like Month to month, 1 year, 2 years etc.
    So I will assign numerical values to them like 1, 2, 3.
    In the end all the data will be transformed to numerical data.

In [1]:
import pandas as pd
data=[{
        "Gender": "Male",
        "Age": 30,
        "Contract Type": "Month-to-Month",
        "Monthly Charges": 50.5,
        "Tenure": 3,
    },
    {
        "Gender": "Female",
        "Age": 42,
        "Contract Type": "One year",
        "Monthly Charges": 65.2,
        "Tenure": 15,
    },
    {
        "Gender": "Female",
        "Age": 28,
        "Contract Type": "Two year",
        "Monthly Charges": 80.0,
        "Tenure": 20,
    },
    {
        "Gender": "Male",
        "Age": 35,
        "Contract Type": "Month-to-Month",
        "Monthly Charges": 45.1,
        "Tenure": 10,
    },
    {
        "Gender": "Male",
        "Age": 50,
        "Contract Type": "Two year",
        "Monthly Charges": 70.3,
        "Tenure": 24,
    }]

In [2]:
df=pd.DataFrame(data)

In [3]:
df

   Gender  Age   Contract Type  Monthly Charges  Tenure
0    Male   30  Month-to-Month             50.5       3
1  Female   42        One year             65.2      15
2  Female   28        Two year             80.0      20
3    Male   35  Month-to-Month             45.1      10
4    Male   50        Two year             70.3      24

In [8]:
gen_num=[]
for i in df['Gender']:
    if i=='Male':
        gen_num.append(1)
    else:
        gen_num.append(0)
df['Gender_numerical']=gen_num
con_num=[]
for i in df['Contract Type']:
    if i == 'Month-to-Month':
        con_num.append(1)
    if i=='One year':
        con_num.append(2)
    if i=='Two year':
        con_num.append(3)
df['Contract Type_numerical']=con_num

In [9]:
df

,Gender,Age,Contract Type,Monthly Charges,Tenure,Gender_numerical,Contract Type_numerical
0,Male,30,Month-to-Month,50.5,3,1,1
1,Female,42,One year,65.2,15,0,2
2,Female,28,Two year,80.0,20,0,3
3,Male,35,Month-to-Month,45.1,10,1,1
4,Male,50,Two year,70.3,24,1,3